In [ ]:
print('sono cotto, abbi pietà!!')

sono cotto, abbi pietà!!

In [16]:
raw_data = {'name': ['Willard Morris', 'Al Jennings', 'Omar Mullins', 'Spencer McDaniel'],
'age': [20, 19, 22, 21],
'favorite_color': ['blue', 'blue', 'yellow', "green"],
'grade': [88, 92, 95, 70]}

df = pd.DataFrame(raw_data)
df.head()

               name  age favorite_color  grade
0    Willard Morris   20           blue     88
1       Al Jennings   19           blue     92
2      Omar Mullins   22         yellow     95
3  Spencer McDaniel   21          green     70

In [27]:
#To select rows whose column value equals a scalar, some_value, use ==:
a = df.loc[df['grade'] == 70]
a

               name  age favorite_color  grade
3  Spencer McDaniel   21          green     70

In [26]:
a.index[0]

3

In [1]:
!pip install investpy

/bin/bash: pip: command not found

In [21]:
import investpy 
from datetime import datetime,date
import pandas as pd

today= date.today().strftime('%d/%m/%Y')


data2 = investpy.get_commodity_historical_data(commodity='US Coffee C', 
                                                from_date='01/01/1980', 
                                                to_date=today,
                                                as_json=False,
                                                order='ascending')
data2

              Open    High     Low   Close  Volume Currency
Date
1980-01-02  182.10  182.25  176.00  177.58    1143      USD
1980-01-03  176.50  176.50  170.50  171.50    1440      USD
1980-01-04  173.37  178.25  173.25  176.16    1292      USD
1980-01-07  175.42  179.00  175.00  178.58    1016      USD
1980-01-08  180.30  183.40  179.00  180.57    1247      USD
...            ...     ...     ...     ...     ...      ...
2021-02-03  123.10  124.85  122.70  123.95   14367      USD
2021-02-04  124.50  124.70  120.20  124.05   32468      USD
2021-02-05  124.65  125.85  123.80  124.50   25376      USD
2021-02-08  124.20  124.80  123.30  124.10   24446      USD
2021-02-09  123.90  123.92  123.55  123.88       0      USD

[10368 rows x 6 columns]

In [22]:
data2 = (
        data2['Close']
        .dropna()
        .to_frame()
        .reset_index()
        .rename(columns={"Date": "ds", 'Close': "y"})
    )
    #st.write("# Forecast - Modello Predittivo " +str(list(COMMODITY.values())[list(COMMODITY.keys()).index(option)]))
df_clean = data2.copy()
df_clean=df_clean.iloc[-700:]
df_clean['ds']=pd.to_datetime(df_clean['ds'])
df_clean['ds']=df_clean['ds'].dt.date
df_clean

               ds       y
9668   2018-05-02  121.60
9669   2018-05-03  122.20
9670   2018-05-04  120.45
9671   2018-05-07  118.20
9672   2018-05-08  116.55
...           ...     ...
10363  2021-02-03  123.95
10364  2021-02-04  124.05
10365  2021-02-05  124.50
10366  2021-02-08  124.10
10367  2021-02-09  123.88

[700 rows x 2 columns]

In [23]:
df_clean.isnull().sum()

ds    0
y     0
dtype: int64

In [24]:
df_clean.dtypes

ds     object
y     float64
dtype: object

In [28]:
index_start = df_clean.loc[df_clean['ds'].astype(str) == '2020-01-18']
#index_start = index_start.index[0]
index_start

Empty DataFrame
Columns: [ds, y]
Index: []

In [74]:
index_finish = df_clean.loc[df_clean['ds'].astype(str) == '2020-08-20']
index_finish = index_finish.index[0]
index_finish

10311